<details>
<summary>Execution result of "run --all -- plan" in "/home/runner/work/terragrunt-demo/terragrunt-demo"</summary>

```terraform
18:53:28.820 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit ./eu-west-1/one
- Unit ./eu-west-2/one

Group 2
- Unit ./eu-west-1/two
- Unit ./eu-west-2/two


18:53:28.859 INFO   [eu-west-1/one] Downloading Terraform configurations from ./source/one into ./eu-west-1/one/.terragrunt-cache/sWirc5LIhqSiaUHTTr6zT4SPreY/9CiuBUsRqYHSW5f6gSamHkhvqBI
18:53:28.862 INFO   [eu-west-2/one] Downloading Terraform configurations from ./source/one into ./eu-west-2/one/.terragrunt-cache/Z-or7QeMz0BWNHo9Zr5Jyexl5EA/9CiuBUsRqYHSW5f6gSamHkhvqBI
18:53:28.888 INFO   [eu-west-1/one] tofu: Initializing the backend...
18:53:28.890 INFO   [eu-west-2/one] tofu: Initializing the backend...
18:53:28.899 INFO   [eu-west-1/one] tofu: 
18:53:28.899 INFO   [eu-west-1/one] tofu: Successfully configured the backend "local"! OpenTofu will automatically
18:53:28.899 INFO   [eu-west-1/one] tofu: use this backend unless the backend configuration changes.
18:53:28.899 INFO   [eu-west-2/one] tofu: 
18:53:28.900 INFO   [eu-west-2/one] tofu: Successfully configured the backend "local"! OpenTofu will automatically
18:53:28.900 INFO   [eu-west-2/one] tofu: use this backend unless the backend configuration changes.
18:53:28.901 INFO   [eu-west-2/one] tofu: Initializing provider plugins...
18:53:28.901 INFO   [eu-west-1/one] tofu: Initializing provider plugins...
18:53:28.901 INFO   [eu-west-2/one] tofu: - Finding hashicorp/random versions matching "~> 3.6.0"...
18:53:28.901 INFO   [eu-west-1/one] tofu: - Finding hashicorp/random versions matching "~> 3.6.0"...
18:53:29.389 INFO   [eu-west-2/one] tofu: - Installing hashicorp/random v3.6.3...
18:53:29.389 INFO   [eu-west-1/one] tofu: - Installing hashicorp/random v3.6.3...
18:53:29.662 INFO   [eu-west-1/one] tofu: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
18:53:29.662 INFO   [eu-west-1/one] tofu: Providers are signed by their developers.
18:53:29.662 INFO   [eu-west-1/one] tofu: If you'd like to know more about provider signing, you can read about it here:
18:53:29.662 INFO   [eu-west-1/one] tofu: https://opentofu.org/docs/cli/plugins/signing/
18:53:29.662 INFO   [eu-west-1/one] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
18:53:29.662 INFO   [eu-west-1/one] tofu: selections it made above. Include this file in your version control repository
18:53:29.662 INFO   [eu-west-1/one] tofu: so that OpenTofu can guarantee to make the same selections by default when
18:53:29.662 INFO   [eu-west-1/one] tofu: you run "tofu init" in the future.
18:53:29.662 INFO   [eu-west-1/one] tofu: OpenTofu has been successfully initialized!
18:53:29.694 INFO   [eu-west-2/one] tofu: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
18:53:29.694 INFO   [eu-west-2/one] tofu: Providers are signed by their developers.
18:53:29.694 INFO   [eu-west-2/one] tofu: If you'd like to know more about provider signing, you can read about it here:
18:53:29.694 INFO   [eu-west-2/one] tofu: https://opentofu.org/docs/cli/plugins/signing/
18:53:29.694 INFO   [eu-west-2/one] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
18:53:29.694 INFO   [eu-west-2/one] tofu: selections it made above. Include this file in your version control repository
18:53:29.694 INFO   [eu-west-2/one] tofu: so that OpenTofu can guarantee to make the same selections by default when
18:53:29.694 INFO   [eu-west-2/one] tofu: you run "tofu init" in the future.
18:53:29.694 INFO   [eu-west-2/one] tofu: OpenTofu has been successfully initialized!
18:53:29.841 STDOUT [eu-west-1/one] tofu: OpenTofu used the selected providers to generate the following execution
18:53:29.841 STDOUT [eu-west-1/one] tofu: plan. Resource actions are indicated with the following symbols:
18:53:29.841 STDOUT [eu-west-1/one] tofu:   + create
18:53:29.841 STDOUT [eu-west-1/one] tofu: OpenTofu will perform the following actions:
18:53:29.841 STDOUT [eu-west-1/one] tofu:   # random_string.foo will be created
18:53:29.841 STDOUT [eu-west-1/one] tofu:   + resource "random_string" "foo" {
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + id          = (known after apply)
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + length      = 12
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + lower       = true
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + min_lower   = 0
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + min_numeric = 0
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + min_special = 0
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + min_upper   = 0
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + number      = true
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + numeric     = true
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + result      = (known after apply)
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + special     = true
18:53:29.842 STDOUT [eu-west-1/one] tofu:       + upper       = true
18:53:29.842 STDOUT [eu-west-1/one] tofu:     }
18:53:29.842 STDOUT [eu-west-1/one] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
18:53:29.842 STDOUT [eu-west-1/one] tofu: 
18:53:29.842 STDOUT [eu-west-1/one] tofu: Changes to Outputs:
18:53:29.842 STDOUT [eu-west-1/one] tofu:   + output = (known after apply)
18:53:29.881 STDOUT [eu-west-2/one] tofu: OpenTofu used the selected providers to generate the following execution
18:53:29.881 STDOUT [eu-west-2/one] tofu: plan. Resource actions are indicated with the following symbols:
18:53:29.881 STDOUT [eu-west-2/one] tofu:   + create
18:53:29.881 STDOUT [eu-west-2/one] tofu: OpenTofu will perform the following actions:
18:53:29.881 STDOUT [eu-west-2/one] tofu:   # random_string.foo will be created
18:53:29.881 STDOUT [eu-west-2/one] tofu:   + resource "random_string" "foo" {
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + id          = (known after apply)
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + length      = 12
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + lower       = true
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + min_lower   = 0
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + min_numeric = 0
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + min_special = 0
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + min_upper   = 0
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + number      = true
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + numeric     = true
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + result      = (known after apply)
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + special     = true
18:53:29.881 STDOUT [eu-west-2/one] tofu:       + upper       = true
18:53:29.881 STDOUT [eu-west-2/one] tofu:     }
18:53:29.881 STDOUT [eu-west-2/one] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
18:53:29.881 STDOUT [eu-west-2/one] tofu: 
18:53:29.882 STDOUT [eu-west-2/one] tofu: Changes to Outputs:
18:53:29.882 STDOUT [eu-west-2/one] tofu:   + output = (known after apply)
18:53:29.899 ERROR  [eu-west-1/two] Error: Unknown variable
18:53:29.899 ERROR  [eu-west-1/two]   on ./eu-west-1/two/terragrunt.hcl line 14:
18:53:29.899 ERROR  [eu-west-1/two]   14:   input = dependency.one.outputs.output
18:53:29.899 ERROR  [eu-west-1/two] There is no variable named "dependency".
18:53:29.900 ERROR  [eu-west-1/two] Unit ./eu-west-1/two has finished with an error
18:53:29.938 ERROR  [eu-west-2/two] Error: Unknown variable
18:53:29.939 ERROR  [eu-west-2/two]   on ./eu-west-2/two/terragrunt.hcl line 14:
18:53:29.939 ERROR  [eu-west-2/two]   14:   input = dependency.one.outputs.output
18:53:29.939 ERROR  [eu-west-2/two] There is no variable named "dependency".
18:53:29.940 ERROR  [eu-west-2/two] Unit ./eu-west-2/two has finished with an error
18:53:29.940 ERROR  Run failed: 4 errors occurred:

* ./eu-west-1/one/terragrunt.hcl is a dependency of ./eu-west-1/two/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs.
  
  If this dependency is accessed before the outputs are ready (which can happen during the planning phase of an unapplied stack), consider using mock_outputs:
  
  dependency "one" {
      config_path = "../one"
  
      mock_outputs = {
          one_output = "mock-one-output"
      }
  }
  
  For more info, see:
  https://terragrunt.gruntwork.io/docs/features/stacks/#unapplied-dependency-and-mock-outputs
  
  If you do not require outputs from your dependency, consider using the dependencies block instead:
  https://terragrunt.gruntwork.io/docs/reference/config-blocks-and-attributes/#dependencies
  

* ./eu-west-1/two/terragrunt.hcl:14,11-21: Unknown variable; There is no variable named "dependency".

* ./eu-west-2/one/terragrunt.hcl is a dependency of ./eu-west-2/two/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs.
  
  If this dependency is accessed before the outputs are ready (which can happen during the planning phase of an unapplied stack), consider using mock_outputs:
  
  dependency "one" {
      config_path = "../one"
  
      mock_outputs = {
          one_output = "mock-one-output"
      }
  }
  
  For more info, see:
  https://terragrunt.gruntwork.io/docs/features/stacks/#unapplied-dependency-and-mock-outputs
  
  If you do not require outputs from your dependency, consider using the dependencies block instead:
  https://terragrunt.gruntwork.io/docs/reference/config-blocks-and-attributes/#dependencies
  

* ./eu-west-2/two/terragrunt.hcl:14,11-21: Unknown variable; There is no variable named "dependency".
```

</details>
    